In [1]:
import pandas as pd

In [3]:
df = pd.DataFrame({
    "Department": ["HR", "HR", "IT", "IT", "Marketing", "Marketing", "Sales", "Sales"],
    "Team": ["A", "A", "B", "B", "C", "C", "D", "D"],
    "Gender": ["M", "F", "M", "F", "M", "F", "M", "F"],
    "Salary(*1000)": [85, 90, 78, 85, 92, 88, 75, 80],
    "Age": [23, 25, 30, 22, 28, 26, 21, 27],
    "JoinDate": pd.to_datetime(["2020-01-10", "2020-02-15", "2021-03-20", "2021-04-10", "2020-05-30", "2020-06-25", "2021-07-15", "2021-08-01"])
})
df

  Department Team Gender  Salary(*1000)  Age   JoinDate
0         HR    A      M             85   23 2020-01-10
1         HR    A      F             90   25 2020-02-15
2         IT    B      M             78   30 2021-03-20
3         IT    B      F             85   22 2021-04-10
4  Marketing    C      M             92   28 2020-05-30
5  Marketing    C      F             88   26 2020-06-25
6      Sales    D      M             75   21 2021-07-15
7      Sales    D      F             80   27 2021-08-01

In [5]:
df.groupby("Department")["Salary(*1000)"].mean()

Department
HR           87.5
IT           81.5
Marketing    90.0
Sales        77.5
Name: Salary(*1000), dtype: float64

In [6]:
type(df.groupby("Department")["Salary(*1000)"].mean())

pandas.core.series.Series

In [8]:
df.groupby("Team")["Salary(*1000)"].mean()

Team
A    87.5
B    81.5
C    90.0
D    77.5
Name: Salary(*1000), dtype: float64

In [9]:
df.groupby("Team")["Salary(*1000)"].sum()

Team
A    175
B    163
C    180
D    155
Name: Salary(*1000), dtype: int64

In [10]:
df.groupby("Team")["Salary(*1000)"].count()

Team
A    2
B    2
C    2
D    2
Name: Salary(*1000), dtype: int64

In [11]:
df.groupby("Team")["Salary(*1000)"].min()

Team
A    85
B    78
C    88
D    75
Name: Salary(*1000), dtype: int64

In [12]:
df.groupby("Team")["Salary(*1000)"].max()

Team
A    90
B    85
C    92
D    80
Name: Salary(*1000), dtype: int64

In [13]:
df.groupby("Team")["Salary(*1000)"].agg(["mean", "max", "min"])

      mean  max  min
Team
A     87.5   90   85
B     81.5   85   78
C     90.0   92   88
D     77.5   80   75

In [14]:
type(df.groupby("Team")["Salary(*1000)"].agg(["mean", "max", "min"]))

pandas.core.frame.DataFrame

In [15]:
df.groupby("Team")["Salary(*1000)"].agg(
    avg_score="mean",
    high_score="max"
)

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [16]:
df.groupby("Team")["Salary(*1000)"].aggregate(
    avg_score="mean",
    high_score="max"
)

      avg_score  high_score
Team
A          87.5          90
B          81.5          85
C          90.0          92
D          77.5          80

In [17]:
df["Team Avg"] = df.groupby("Team")["Salary(*1000)"].transform("mean")
df

  Department Team Gender  Salary(*1000)  Age   JoinDate  Team Avg
0         HR    A      M             85   23 2020-01-10      87.5
1         HR    A      F             90   25 2020-02-15      87.5
2         IT    B      M             78   30 2021-03-20      81.5
3         IT    B      F             85   22 2021-04-10      81.5
4  Marketing    C      M             92   28 2020-05-30      90.0
5  Marketing    C      F             88   26 2020-06-25      90.0
6      Sales    D      M             75   21 2021-07-15      77.5
7      Sales    D      F             80   27 2021-08-01      77.5

In [19]:
df.groupby("Team").filter(lambda x: x["Salary(*1000)"].mean() > 85)
df

  Department Team Gender  Salary(*1000)  Age   JoinDate  Team Avg
0         HR    A      M             85   23 2020-01-10      87.5
1         HR    A      F             90   25 2020-02-15      87.5
2         IT    B      M             78   30 2021-03-20      81.5
3         IT    B      F             85   22 2021-04-10      81.5
4  Marketing    C      M             92   28 2020-05-30      90.0
5  Marketing    C      F             88   26 2020-06-25      90.0
6      Sales    D      M             75   21 2021-07-15      77.5
7      Sales    D      F             80   27 2021-08-01      77.5